;XCOM 2 relies on per-object config settings like the one below to link X2DataTemplate objects with their associated localized text

[BOLTER_CV X2WeaponTemplate]
FriendlyName="底格里斯型爆弹枪"
FriendlyNamePlural="底格里斯型爆弹枪"
BriefSummary="底格里斯型爆弹枪在铸造世界底格里斯中发现，她的STC数据在荷鲁斯叛乱之前迅速在帝国中传播。"
TacticalText="<Bullet/>帝皇之敌一息尚存，则无和平可言...\n<Bullet/>为了帝皇！"
AbilityDescName="爆弹枪"

[BOLTER_MG X2WeaponTemplate]
FriendlyName="火卫一型爆弹枪"
FriendlyNamePlural="火卫一型爆弹枪"
BriefSummary="火卫一型在帝国诞生时由火星的铸造者们手工打造，以确保每个星际战士都有最好的武装，在大远征期间能够更好地收复人类失地。"
TacticalText="<Bullet/>帝皇之敌一息尚存，则无和平可言...\n<Bullet/>为了帝皇！"
AbilityDescName="爆弹枪"

[BOLTER_BM X2WeaponTemplate]
FriendlyName="戈德温型爆弹枪"
FriendlyNamePlural="戈德温型爆弹枪"
BriefSummary="戈德温型使用标准的.75英寸爆弹，由金刚石弹头、贫化氘核心和质量反应雷管组成，通常四轮爆发推进。"
TacticalText="<Bullet/>帝皇之敌一息尚存，则无和平可言...\n<Bullet/>为了帝皇！"
AbilityDescName="爆弹枪"
